{
  "block-footer-1": "Basic footer layout with essential links and company information. Features simple column structure with navigation links, contact details, and copyright information.",
  "block-footer-2": "Comprehensive footer with multiple content sections and social links. Features multi-column layout with detailed navigation, social media integration, and extended company information.",
  "block-footer-3": "Advanced footer design with newsletter signup and rich content organization. Features subscription forms, detailed link categories, and enhanced brand presentation elements.",
  "block-header-1": "Classic left-aligned logo navigation with 3 simple links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). NO hover animation on menu items. Navbar remains STICKY at top when scrolling. Ideal for: corporate sites, portfolios, landing pages needing persistent navigation.",
  "block-header-10": "Dynamic left-aligned logo navigation with 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Menu items SCALE UP slightly on hover for playful interaction. Navbar scrolls NORMALLY with page content (not sticky). Ideal for: gaming sites, creative landing pages, playful brands without persistent navigation.",
  "block-header-11": "Minimalist left-aligned logo navigation with 3 simple links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Absolutely NO styling or hover effects on menu items for pure simplicity. Navbar remains STICKY at top when scrolling. Ideal for: minimal designs, brutalist aesthetics, content-first sites, distraction-free interfaces.",
  "block-header-12": "Minimalist left-aligned logo navigation with 3 simple links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Absolutely NO styling or hover effects on menu items for pure simplicity. Navbar scrolls NORMALLY with page content (not sticky). Ideal for: minimal designs, brutalist aesthetics, content-first sites without persistent navigation.",
  "block-header-13": "SPLIT-LAYOUT navigation: logo on left, authentication on right. Contains 2 simple links (Features, Pricing) + ghost Login button + primary Sign Up button. NO hover animation on menu items. Navbar remains STICKY at top when scrolling. Ideal for: SaaS platforms, subscription services, web apps requiring clear login/signup CTAs.",
  "block-header-14": "SPLIT-LAYOUT navigation: logo on left, authentication on right. Contains 2 simple links (Features, Pricing) + ghost Login button + primary Sign Up button. NO hover animation on menu items. Navbar scrolls NORMALLY with page content (not sticky). Ideal for: SaaS landing pages, subscription services, marketing pages without persistent navigation.",
  "block-header-15": "Modern SPLIT-LAYOUT navigation: logo on left, authentication on right. Contains 2 links (Features, Pricing) + ghost Login button + primary Sign Up button. Menu items display ROUNDED PILL background on hover for modern look. Navbar remains STICKY at top when scrolling. Ideal for: modern SaaS platforms, tech products, cloud services needing prominent auth.",
  "block-header-16": "Modern SPLIT-LAYOUT navigation: logo on left, authentication on right. Contains 2 links (Features, Pricing) + ghost Login button + primary Sign Up button. Menu items display ROUNDED PILL background on hover for modern look. Navbar scrolls NORMALLY with page content (not sticky). Ideal for: SaaS landing pages, tech products, marketing pages without persistent navigation.",
  "block-header-17": "Elegant SPLIT-LAYOUT navigation: logo on left, authentication on right. Contains 2 links (Features, Pricing) + ghost Login button + primary Sign Up button. Menu items show ANIMATED UNDERLINE on hover for sophisticated appearance. Navbar remains STICKY at top when scrolling. Ideal for: premium SaaS, B2B platforms, professional services requiring elegant auth experience.",
  "block-header-18": "Elegant SPLIT-LAYOUT navigation: logo on left, authentication on right. Contains 2 links (Features, Pricing) + ghost Login button + primary Sign Up button. Menu items show ANIMATED UNDERLINE on hover for sophisticated appearance. Navbar scrolls NORMALLY with page content (not sticky). Ideal for: premium SaaS landing pages, B2B platforms without persistent navigation.",
  "block-header-19": "Interactive SPLIT-LAYOUT navigation: logo on left, authentication on right. Contains 2 links (Features, Pricing) + ghost Login button + primary Sign Up button. Menu items display subtle LIFT/ELEVATION effect on hover for depth. Navbar remains STICKY at top when scrolling. Ideal for: modern SaaS products, developer tools, tech platforms needing interactive feel.",
  "block-header-2": "Classic left-aligned logo navigation with 3 simple links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). NO hover animation on menu items. Navbar scrolls NORMALLY with page content (not sticky). Ideal for: single-page sites, blogs, portfolios where navigation doesn't need to persist.",
  "block-header-20": "Interactive SPLIT-LAYOUT navigation: logo on left, authentication on right. Contains 2 links (Features, Pricing) + ghost Login button + primary Sign Up button. Menu items display subtle LIFT/ELEVATION effect on hover for depth. Navbar scrolls NORMALLY with page content (not sticky). Ideal for: SaaS landing pages, developer tools without persistent navigation.",
  "block-header-21": "Dynamic SPLIT-LAYOUT navigation: logo on left, authentication on right. Contains 2 links (Features, Pricing) + ghost Login button + primary Sign Up button. Menu items SCALE UP slightly on hover for playful interaction. Navbar remains STICKY at top when scrolling. Ideal for: startup SaaS, young tech brands, playful platforms needing prominent authentication.",
  "block-header-22": "Dynamic SPLIT-LAYOUT navigation: logo on left, authentication on right. Contains 2 links (Features, Pricing) + ghost Login button + primary Sign Up button. Menu items SCALE UP slightly on hover for playful interaction. Navbar scrolls NORMALLY with page content (not sticky). Ideal for: startup landing pages, young tech brands without persistent navigation.",
  "block-header-23": "Minimalist SPLIT-LAYOUT navigation: logo on left, authentication on right. Contains 2 simple links (Features, Pricing) + ghost Login button + primary Sign Up button. Absolutely NO styling or hover effects for pure simplicity. Navbar remains STICKY at top when scrolling. Ideal for: minimal SaaS, clean auth interfaces, distraction-free login/signup experiences.",
  "block-header-24": "Minimalist SPLIT-LAYOUT navigation: logo on left, authentication on right. Contains 2 simple links (Features, Pricing) + ghost Login button + primary Sign Up button. Absolutely NO styling or hover effects for pure simplicity. Navbar scrolls NORMALLY with page content (not sticky). Ideal for: minimal SaaS landing pages, clean auth without persistent navigation.",
  "block-header-25": "Symmetrical CENTER-LOGO navigation with logo prominently centered. Contains 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). NO hover animation on menu items. Navbar remains STICKY at top when scrolling. Ideal for: fashion brands, creative agencies, portfolios, luxury brands emphasizing logo prominence.",
  "block-header-26": "Symmetrical CENTER-LOGO navigation with logo prominently centered. Contains 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). NO hover animation on menu items. Navbar scrolls NORMALLY with page content (not sticky). Ideal for: fashion brands, creative agencies, portfolios without persistent navigation.",
  "block-header-27": "Modern symmetrical CENTER-LOGO navigation with logo prominently centered. Contains 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Menu items display ROUNDED PILL background on hover for modern look. Navbar remains STICKY at top when scrolling. Ideal for: modern fashion brands, design studios, creative tech emphasizing centered branding.",
  "block-header-28": "Modern symmetrical CENTER-LOGO navigation with logo prominently centered. Contains 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Menu items display ROUNDED PILL background on hover for modern look. Navbar scrolls NORMALLY with page content (not sticky). Ideal for: modern creative landing pages, design studios without persistent navigation.",
  "block-header-29": "Elegant symmetrical CENTER-LOGO navigation with logo prominently centered. Contains 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Menu items show ANIMATED UNDERLINE on hover for sophisticated appearance. Navbar remains STICKY at top when scrolling. Ideal for: luxury brands, high-end agencies, editorial sites emphasizing refined centered design.",
  "block-header-3": "Modern left-aligned logo navigation with 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Menu items display ROUNDED PILL background on hover for modern look. Navbar remains STICKY at top when scrolling. Ideal for: SaaS products, tech startups, modern web apps needing contemporary feel.",
  "block-header-30": "Elegant symmetrical CENTER-LOGO navigation with logo prominently centered. Contains 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Menu items show ANIMATED UNDERLINE on hover for sophisticated appearance. Navbar scrolls NORMALLY with page content (not sticky). Ideal for: luxury brands, high-end agencies without persistent navigation.",
  "block-header-31": "Interactive symmetrical CENTER-LOGO navigation with logo prominently centered. Contains 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Menu items display subtle LIFT/ELEVATION effect on hover for depth. Navbar remains STICKY at top when scrolling. Ideal for: interactive portfolios, design-forward brands, creative platforms emphasizing centered logo.",
  "block-header-32": "Interactive symmetrical CENTER-LOGO navigation with logo prominently centered. Contains 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Menu items display subtle LIFT/ELEVATION effect on hover for depth. Navbar scrolls NORMALLY with page content (not sticky). Ideal for: interactive portfolios, design-forward landing pages without persistent navigation.",
  "block-header-33": "Dynamic symmetrical CENTER-LOGO navigation with logo prominently centered. Contains 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Menu items SCALE UP slightly on hover for playful interaction. Navbar remains STICKY at top when scrolling. Ideal for: playful brands, youth-oriented products, creative sites emphasizing centered logo with energy.",
  "block-header-34": "Dynamic symmetrical CENTER-LOGO navigation with logo prominently centered. Contains 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Menu items SCALE UP slightly on hover for playful interaction. Navbar scrolls NORMALLY with page content (not sticky). Ideal for: playful brands, youth-oriented landing pages without persistent navigation.",
  "block-header-35": "Minimalist symmetrical CENTER-LOGO navigation with logo prominently centered. Contains 3 simple links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Absolutely NO styling or hover effects for pure simplicity. Navbar remains STICKY at top when scrolling. Ideal for: minimal brands, brutalist aesthetics, centered-logo designs with zero distractions.",
  "block-header-36": "Minimalist symmetrical CENTER-LOGO navigation with logo prominently centered. Contains 3 simple links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Absolutely NO styling or hover effects for pure simplicity. Navbar scrolls NORMALLY with page content (not sticky). Ideal for: minimal brands, brutalist landing pages without persistent navigation.",
  "block-header-37": "Minimalist left-aligned logo navigation with ONLY 2 simple links (Home, About) and 1 primary CTA button (Contact). Menu items display subtle LIFT/ELEVATION effect with FAST animation (150ms duration, 75ms delay). Navbar scrolls normally. Ideal for: small businesses, simple portfolios, minimal contact-focused sites needing snappy interactions.",
  "block-header-38": "Minimalist left-aligned logo navigation with ONLY 2 simple links (Home, About) and 1 primary CTA button (Contact). Menu items SCALE UP with DRAMATIC SLOW animation (700ms duration, 200ms delay) for theatrical effect. Navbar scrolls normally. Ideal for: artistic portfolios, theatrical presentations, dramatic brand experiences needing slow, emphasized interactions.",
  "block-header-39": "COMPLEX left-aligned navigation with EXTENSIVE menu: 2 simple links (Home, Pricing) + 2 multi-item dropdowns (Products with 3 items, Solutions with 2 items) + outline Contact Sales button + primary Start Trial button. Menu items show ANIMATED UNDERLINE on hover. Navbar scrolls normally. Ideal for: enterprise platforms, complex products, B2B SaaS needing comprehensive navigation with dual CTAs.",
  "block-header-4": "Modern left-aligned logo navigation with 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Menu items display ROUNDED PILL background on hover for modern look. Navbar scrolls NORMALLY with page content (not sticky). Ideal for: SaaS products, tech startups, modern landing pages without persistent navigation.",
  "block-header-40": "CUSTOM-STYLED left-aligned navigation with gradient-branded logo. Contains 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Menu items display ROUNDED PILL background on hover with CUSTOM background/padding styling (menuClasses: bg-gray-100 rounded-full px-6 py-2). Navbar scrolls normally. Ideal for: unique branded experiences, custom-designed sites, special styling requirements.",
  "block-header-5": "Elegant left-aligned logo navigation with 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Menu items show ANIMATED UNDERLINE on hover for sophisticated appearance. Navbar remains STICKY at top when scrolling. Ideal for: editorial sites, blogs, professional services, agencies needing elegant design.",
  "block-header-6": "Elegant left-aligned logo navigation with 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Menu items show ANIMATED UNDERLINE on hover for sophisticated appearance. Navbar scrolls NORMALLY with page content (not sticky). Ideal for: editorial sites, blogs, professional services, single-page designs.",
  "block-header-7": "Interactive left-aligned logo navigation with 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Menu items display subtle LIFT/ELEVATION effect on hover for depth. Navbar remains STICKY at top when scrolling. Ideal for: modern web apps, design portfolios, creative agencies wanting interactive feel.",
  "block-header-8": "Interactive left-aligned logo navigation with 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Menu items display subtle LIFT/ELEVATION effect on hover for depth. Navbar scrolls NORMALLY with page content (not sticky). Ideal for: modern landing pages, design portfolios, creative sites without persistent navigation.",
  "block-header-9": "Dynamic left-aligned logo navigation with 3 links (Home, Products, About), 1 Resources dropdown, and 1 primary CTA button (Get Started). Menu items SCALE UP slightly on hover for playful interaction. Navbar remains STICKY at top when scrolling. Ideal for: gaming sites, creative portfolios, playful brands, youth-oriented products."
}