{
  "block-content-1": "Basic content section with text-focused layout and simple structure. Features headline, body text, and clean typography for informational content presentation.",
  "block-content-2": "Visual content section with overlapping image design and text integration. Features creative image layouts combined with descriptive content for enhanced visual storytelling.",
  "block-content-3": "Media-rich content section with video integration and supporting text. Features video player with descriptive content for multimedia presentations and product demonstrations.",
  "block-cta-1": "Centered call-to-action section with prominent headline, descriptive text, and primary action button. Clean and focused design for maximum conversion impact.",
  "block-cta-2": "Visual call-to-action layout combining compelling imagery with persuasive text and action buttons. Two-column design balances visual appeal with conversion elements.",
  "block-cta-3": "Minimal call-to-action section with focused messaging and single primary action. Streamlined design emphasizes urgency and clear value proposition for immediate conversions.",
  "block-faq-1": "Accordion-style FAQ section with expandable question-answer pairs. Features section header, organized Q&A layout with collapsible content for efficient information access.",
  "block-faq-2": "Enhanced FAQ layout with categorized questions and improved navigation. Features organized FAQ groups, search functionality, and user-friendly question organization.",
  "block-faq-3": "Comprehensive FAQ section with detailed content organization and visual enhancements. Features extensive Q&A coverage, visual elements, and structured information hierarchy.",
  "block-feature-1": "Grid-based feature showcase with icon-text combinations and structured layout. Features section header, multiple feature items with icons, headlines, and descriptions. Perfect for highlighting product capabilities and service benefits.",
  "block-feature-2": "Comprehensive feature section with visual elements and detailed descriptions. Combines imagery, icons, and text in a structured layout to showcase multiple product features or service advantages effectively.",
  "block-feature-3": "Organized feature display with clear categorization and visual hierarchy. Features section title, feature grid layout with icons, and detailed explanations. Ideal for complex products requiring clear feature communication.",
  "block-hero-1": "Single-column centered hero layout with announcement badge, large headline, description text, multiple CTA buttons, and customer logo showcase section. Perfect for product launches and service announcements.",
  "block-hero-10": "Single-column centered hero with comprehensive feature showcase. Includes large headline, description text, feature grid, and CTA elements. Great for product launches and feature-rich applications.",
  "block-hero-11": "Full-width hero layout with extensive content organization and multiple feature sections. Combines visual elements with detailed feature presentation and CTA integration.",
  "block-hero-12": "Streamlined hero layout with clean typography and focused content presentation. Features headline, description, and clear call-to-action in a minimalist design approach.",
  "block-hero-13": "Grid-based hero layout with structured content organization and visual hierarchy. Features multiple content blocks arranged in a clean grid system for enhanced readability and visual impact.",
  "block-hero-14": "Purpose-driven hero layout with emotional impact design. Features compelling headline, mission-focused content, and strong call-to-action elements. Ideal for non-profits, causes, and community organizations.",
  "block-hero-15": "Two-column book promotion layout with content showcase and visual presentation. Features title, description, author information, and purchase options. Perfect for books, publications, and creative works.",
  "block-hero-16": "Blog-style hero layout with content discovery focus. Features article headlines, excerpts, and navigation elements. Designed for blogs, news sites, and content-driven platforms.",
  "block-hero-17": "Mobile app-focused hero with app store integration and device mockups. Features app description, download buttons, and visual app presentation. Perfect for mobile app landing pages and launches.",
  "block-hero-2": "Two-column hero layout with sidebar-right configuration featuring headline, description, CTA buttons on the left and visual content on the right. Ideal for professional services and business presentations.",
  "block-hero-3": "Two-column balanced hero layout with content area containing headline, description, CTA buttons, and features list. Paired with visual showcase area. Great for detailed product presentations.",
  "block-hero-4": "Clean two-column hero layout with left content area featuring headline, description, and CTA button paired with right visual area. Simple and effective for agencies and portfolios.",
  "block-hero-5": "Creative hero layout with large visual showcase and multiple CTA options. Features prominent image display with dual action buttons. Perfect for events, conferences, and visual-first presentations.",
  "block-hero-6": "Two-column hero layout with primary content area containing headline, description text, structured information grid, and prominent download CTA. Features secondary visual area and company logo showcase section below. Ideal for product launches and software applications.",
  "block-hero-7": "Comprehensive hero layout with structured content sections, feature highlights, and multiple content blocks. Includes headline, description, and organized feature presentation. Ideal for software products and detailed service offerings.",
  "block-hero-8": "Immersive hero layout designed for experiential businesses. Features compelling visual storytelling with headline, description, and engaging CTA elements. Perfect for travel, hospitality, and experience-based services.",
  "block-hero-9": "Feature-focused hero layout with prominent headline, descriptive content, and structured feature presentation. Designed to highlight product capabilities and benefits effectively.",
  "block-logos-1": "Customer logo showcase with clean grid layout and brand display. Features company logos arranged in organized rows for social proof and credibility building.",
  "block-logos-2": "Enhanced logo section with contextual messaging and organized brand presentation. Features section header, customer logos grid, and supporting text for trust building and social proof.",
  "block-logos-3": "Compact logo display with streamlined brand showcase format. Features simplified logo grid layout ideal for highlighting key partnerships and customer relationships.",
  "block-pricing-1": "Classic pricing table layout with multiple plan tiers, feature comparisons, and CTA buttons. Includes section header, pricing cards with features lists, and clear tier differentiation for subscription-based services.",
  "block-pricing-2": "Advanced pricing display with detailed plan features and enhanced visual hierarchy. Features pricing cards, feature comparisons, billing toggle, and prominent upgrade options. Perfect for SaaS and subscription businesses.",
  "block-pricing-3": "Upgrade-focused pricing section designed to drive plan conversions. Features benefit highlights, comparison elements, and compelling upgrade messaging. Ideal for freemium models and plan upgrade campaigns.",
  "block-socialproof-1": "Social proof section with customer metrics and credibility indicators. Features statistics, testimonial highlights, and trust-building elements for conversion optimization.",
  "block-socialproof-2": "Enhanced social proof layout with multiple validation elements and visual testimonials. Features customer stories, review highlights, and comprehensive credibility showcase.",
  "block-socialproof-3": "Visual social proof section combining statistics with illustrative design elements. Features numerical metrics, visual representations, and compelling social validation for maximum impact.",
  "block-team-1": "Team showcase layout with member profiles, photos, and biographical information. Features section header, team member grid with photos, names, roles, and descriptions. Perfect for about pages and company presentations.",
  "block-team-2": "Enhanced team section with detailed member profiles and social links. Features comprehensive team member cards with photos, roles, bios, and contact information in organized grid layout.",
  "block-team-3": "Compact team display with avatar-focused design and essential member information. Features clean avatar grid with names and roles in minimalist presentation format.",
  "block-testimonial-1": "Simple testimonial layout with customer quote, attribution, and clean typography. Features single testimonial with author information and minimalist design approach.",
  "block-testimonial-2": "Multi-testimonial grid layout with customer photos, quotes, and detailed attribution. Features multiple testimonials in organized grid format with enhanced visual presentation and credibility elements.",
  "block-testimonial-3": "Featured testimonial section with prominent customer showcase and detailed social proof elements. Includes large testimonial display with customer details and trust-building visual components."
}