{
  "blog-example-1": "A modern tech blog featuring articles about web development, AI, and software engineering best practices with a clean, professional design.",
  "application-job": "A comprehensive job application form with personal details, work experience, education, skills, and file upload for resume/cover letter. Perfect for companies and HR departments to collect structured candidate information and streamline the hiring process.",
  "application-membership": "A professional membership application form with applicant details, membership tier selection, professional background, references, and payment information. Ideal for professional associations, clubs, organizations, and exclusive communities to process new member applications.",
  "booking-appointment-medical": "A medical appointment scheduling form with patient information, appointment type selection, preferred dates/times, and insurance details. Ideal for healthcare providers, clinics, and medical practices to streamline patient appointment bookings.",
  "booking-table-restaurant": "A restaurant table booking form with guest details, reservation date/time, party size, and special requests including dietary restrictions and seating preferences. Perfect for restaurants, cafes, and dining establishments to manage online reservations.",
  "contact-professional": "A comprehensive professional contact form with multiple sections including office location, business hours, and team contact information. Ideal for businesses that want to provide detailed contact options and build trust with potential clients.",
  "demo-request-product": "A product demo scheduling form with company details, team size, preferred time slots, and specific interests. Ideal for SaaS companies and B2B service providers to qualify and schedule product demonstrations with potential clients.",
  "feedback-product": "A comprehensive product feedback form with feature ratings, bug reporting, and improvement suggestions. Perfect for SaaS companies and product teams to collect structured user feedback and identify product enhancement opportunities.",
  "form-booking": "A complete hotel booking and reservation form with date selection, room preferences, guest information, and special requests. Perfect for hotels, vacation rentals, event venues, and appointment scheduling.",
  "form-contact": "A professional contact form with customer satisfaction rating. Perfect for gathering customer inquiries, feedback, and testimonials with built-in validation and user-friendly design.",
  "form-inspection": "A professional inspection and audit form for field technicians and service professionals. Features pass/fail evaluations, photo uploads, detailed notes, and digital signatures for compliance and documentation.",
  "form-quiz": "A comprehensive educational quiz and exam platform with timed assessments, multiple question types, instant feedback, and scoring. Perfect for online courses, certification exams, and interactive learning experiences.",
  "form-simple": "A minimal form example with one input field and two action buttons - perfect for learning the basics.",
  "form-survey": "A comprehensive survey form for gathering customer feedback, market research, and user opinions. Features single-choice questions, multiple-choice selections, rating scales, and dropdown lists for detailed data collection.",
  "newsletter-signup": "A clean and simple newsletter subscription form with interest preferences, frequency selection, and GDPR-compliant consent. Perfect for blogs, content creators, and businesses building their email list.",
  "quiz-assessment": "An interactive skills assessment quiz with multiple-choice questions, self-evaluation ratings, and personalized recommendations. Perfect for educational platforms, HR departments, training programs, and career development to evaluate knowledge levels and provide tailored learning paths.",
  "quote-request-service": "A detailed service quote request form with project scope, budget range, timeline, and service type selection. Perfect for service providers, consultants, and agencies to gather comprehensive project information from potential clients.",
  "registration-course": "A comprehensive course registration form with student information, course selection, experience level, learning objectives, and payment details. Perfect for educational institutions, training providers, and online learning platforms to streamline student enrollment.",
  "registration-event": "A comprehensive event registration form with attendee information, ticket selection, session preferences, dietary requirements, and networking options. Perfect for conferences, workshops, seminars, and corporate events to manage attendee registrations efficiently.",
  "registration-webinar": "A streamlined webinar signup form with attendee details, session selection, timezone preferences, and reminder options. Perfect for online events, training sessions, product launches, and educational webinars to capture registrations and send automated confirmations.",
  "survey-customer-satisfaction": "A comprehensive customer satisfaction survey with rating scales, multiple choice questions, and open-ended feedback. Perfect for gathering customer insights, measuring service quality, and identifying areas for improvement.",
  "survey-market-research": "A comprehensive market research survey with demographic questions, product preferences, purchasing behavior analysis, and competitive insights. Perfect for businesses conducting market analysis, product development research, and customer segmentation studies.",
  "beauty-nyc-center": "An inviting and informative online presence for a beauty center in New York, allowing clients to discover services, view portfolios, book appointments, and contact the center.",
  "beauty-nyc-minimal": "Create a professional and elegant website for a beauty center in New York.",
  "beauty-serenity-nyc": "A professional and inviting full website for a beauty center in New York, showcasing services, allowing online booking, and providing contact information.",
  "blog-tech": "A modern technology blog website with articles on web development, AI, cloud computing, and software engineering. Features a clean reading experience, author profiles, category filtering, and responsive design. Perfect for tech bloggers, developer advocates, and technical content creators.",
  "landing-saas": "Professional SaaS landing page for CloudSync, a file synchronization platform. Features hero with announcement badge, social proof logos, stats showcase, detailed feature grid, customer testimonials with avatars, pricing table with multiple tiers, FAQ section, and conversion-optimized CTAs. Demonstrates modern landing page best practices with specialized components.",
  "portfolio-developer": "A modern developer portfolio website showcasing projects, skills, experience, and contact information. Features a clean minimalist design, project gallery with case studies, tech stack highlights, and professional about section. Perfect for software engineers, web developers, and technical professionals seeking to showcase their work.",
  "restaurant-fine-dining": "An elegant fine dining restaurant website featuring menu showcase, online reservations, chef profiles, and ambiance gallery. Demonstrates sophisticated design with rich imagery, seasonal menus, testimonials, and integrated booking system. Perfect for upscale restaurants, bistros, and culinary establishments.",
  "steel-usa-manufacturer": "A professional, multi-page website for a steel manufacturer based in the USA to showcase their products, services, and company information, emphasizing product quality and manufacturing capabilities.",
  "steel-yellowstone": "A professional, multi-page website for Yellow Stone Steel, a steel manufacturer based in the USA, to showcase their products, services, and company information.",
  "website-blog-example": "A complete website example featuring a home page with hero section, features, and call-to-action, plus a dedicated blog listing page showcasing the BlogMainPage component with grid layout and pagination."
}